"espk" = "Apple揚聲器埠";
"ispk" = "內置";
"emic" = "咪高風埠";
"imic" = "內置";
"hdpn" = "耳機埠";
"lini" = "音訊Line In埠";
"lino" = "音訊Line Out埠";
"spdi" = "數碼光纖輸入埠";
"spdo" = "數碼光纖輸出埠";
"pci " = "PCI卡";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "網路裝置";
"blue" = "藍牙";
"bluh" = "藍牙耳機";
"blus" = "藍牙耳麥";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
"airp" = "AirPlay";
